{
    "server_component": { "title": "This is a server Component " },
    "client_component": { "title": "This is a client Component " },
    "ارتقِ بمهاراتك إلى آفاق": "Take your skills to new horizons",
    "جديدة": "new",
    "مع": "with",
    "مركز إنجاز المتحدة للتدريب": "Enjaz United Training Center",
    "حيث يلتقي الإبداع بالتميز.": "where creativity meets excellence.",
    "اكتشف إمكانياتك وحقق أهدافك": "Discover your potential and achieve your goals",
    "إقرأ المزيد": "Read more",
    "إنجاز المتحدة وجهتك لتنمية المهارات وتطوير المواهب": "Enjaz United is your destination for skill development and talent cultivation",
    "حلول تدريبية مبتكرة تدعم النمو المؤسسي وتواكب متطلبات السوق": "Innovative training solutions that support institutional growth and meet market demands",
    "في مركز إنجاز المتحدة للتدريب، نركز على تقديم حلول تدريبية مبتكرة تعزز المهارات الشخصية، وتنمي المواهب من خلال برامج شاملة. نضمن جودة التدريب عبر استشارات مهنية واستراتيجية تدعم النمو المؤسسي. نلتزم بالتميز من خلال شراكات عالمية، ونطور منهجيات تدريبية مبتكرة تتماشى مع احتياجات السوق المتغيرة لتحقيق أفضل النتائج.": "At Enjaz United Training Center, we focus on providing innovative training solutions that enhance personal skills and develop talent through comprehensive programs. We ensure training quality through professional consulting and strategies that support institutional growth. We are committed to excellence through global partnerships, developing innovative training methodologies that align with changing market needs to achieve the best results.",
    "صورة إنجاز": "Achievement Image",
    "تعرف علينا": "Get to know us",
    "إنجاز المتحدة للتدريب الرائدة في التدريب المؤسسي والتكنولوجيا التعليمية في منطقة الشرق الأوسط": "Enjaz United, the leader in corporate training and educational technology in the Middle East",
    "حيث نقدم أكثر الحلول شمولية في تطوير التعلم والتدريب في جميع الوظائف المؤسسية الاستراتيجية، بما في ذلك، الموارد البشرية، الموارد الرقمية والدورات المهنية والمتخصصة في جميع المجالات. من خلال جلسات تدريبية بقيادة مدربين، وتدريب داخل الشركات، والإرشاد، وأحدث الحلول التقنية في جميع أنحاء منطقة الشرق الأوسط نقدم لعملائنا الكرام مجموعة واسعة من الخدمات، بما في ذلك تحليل احتياجات التدريب": "We offer the most comprehensive solutions for developing learning and training in all strategic corporate functions, including human resources, digital resources, and specialized professional courses across all fields. Through trainer-led sessions, in-house training, mentoring, and the latest technical solutions across the Middle East, we provide our valued clients with a wide range of services, including training needs analysis.",
    "الإعتمادات المهنية": "Professional Accreditations",
    "شركاؤنا في الاعتماد المهني": "Our Accreditation Partners",
    "إنــجاز فــي أرقــام": "Achievements in Numbers",
    "في مركز إنجاز المتحدة للتدريب، نركز على تقديم حلول تدريبية مبتكرة تعزز المهارات الشخصية، وتنمي المواهب من خلال برامج شاملة. نضمن جودة التدريب عبر استشارات مهنية واستراتيجية تدعم النمو المؤسسي. نلتزم بالتميز": "At Enjaz United Training Center, we focus on providing innovative training solutions that enhance personal skills and develop talent through comprehensive programs. We ensure training quality through professional consulting and strategies that support organizational growth. We are committed to excellence",
    "خلفية المتجهات": "Background Vector",
    "التكنولوجيا والابتكار في مركز إنجاز المتحدة للتدريب": "Technology and Innovation at Enjaz United Training Center",
    "في مركز إنجاز المتحدة للتدريب، نعتبر التكنولوجيا والابتكار مفتاحاً لتحسين تجربة التعلم وتقديم حلول تدريبية متطورة. نحن ملتزمون بتوظيف أحدث التقنيات لرفع مستوى التدريب وتحقيق نتائج ملموسة. إليك كيف نستخدم التكنولوجيا والابتكار في تقديم خدماتنا.": "At Enjaz United Training Center, we consider technology and innovation as key to enhancing the learning experience and providing advanced training solutions. We are committed to using the latest technologies to elevate training and achieve tangible results. Here’s how we use technology and innovation to deliver our services.",
    "خدماتنا": "Our Services",
    "خلفية المتجه": "Background Vector",
    "نقدم أكثر من 16 خدمة متكاملة لتطوير الأفراد والمؤسسات، تشمل التدريب المتخصص، التحليل الدقيق للاحتياجات، والتعلم الإلكتروني، وغيرها من الحلول المصممة لدعم النجاح المؤسسي.": "We offer more than 16 integrated services for developing individuals and organizations, including specialized training, precise needs analysis, e-learning, and other solutions designed to support institutional success.",
    "تحليل الاحتياجات التدريبية": "Training Needs Analysis",
    "نقوم بتحليل دقيق للفجوات في المهارات والمعرفة لضمان تقديم حلول تدريبية مخصصة تحقق أهدافك بفاعلية": "We conduct a detailed analysis of skill and knowledge gaps to ensure customized training solutions that effectively meet your objectives.",
    "تصميم وتنفيذ برامج مخصصة": "Design and Implementation of Customized Programs",
    "نصمم برامج تدريبية شاملة ومتكاملة تتوافق مع احتياجاتك الاستراتيجية وتعزز من كفاءتك العملية": "We design comprehensive and integrated training programs that align with your strategic needs and enhance operational efficiency.",
    "التعلم الإلكتروني": "E-Learning",
    "نمنحك فرصة التعلم في أي وقت ومن أي مكان عبر حلول تعليمية مرنة تتناسب مع جدولك": "We provide flexible educational solutions that allow learning anytime and anywhere to suit your schedule.",
    "استشارات تحسين الأداء": "Performance Improvement Consulting",
    "نقدم استراتيجيات متقدمة لتحسين الأداء الفردي والمؤسسي، مما يضمن تحقيق أهدافك بكفاءة أعلى": "We offer advanced strategies for improving individual and organizational performance, ensuring you achieve your goals with greater efficiency.",
    "عرض جميع الخدمات": "View All Services",
    "مفهوم إنجاز": "Enjaz Concept",
    "إبداع الحلول التدريبية": "Creative Training Solutions",
    "نقدم حلولًا تدريبية مبتكرة لتعزيز المهارات الشخصية باستخدام منهجيات عالمية.": "We provide innovative training solutions to enhance personal skills using global methodologies.",
    "نماء المواهب": "Talent Development",
    "ملتزمون بتطوير المواهب عبر برامج تدريبية شاملة تعزز المهارات وتفتح آفاقًا جديدة.": "We are committed to developing talents through comprehensive training programs that enhance skills and open new horizons.",
    "جودتنا في التدريب": "Our Training Quality",
    "نقدم استشارات مهنية واستراتيجية تساهم في النمو المؤسسي.": "We offer professional and strategic consulting that contributes to organizational growth.",
    "التزامنا بالتميز": "Our Commitment to Excellence",
    "نقدم خدمات رائدة ونعمل بالتعاون مع القطاعات المهنية والشركات العالمية.": "We offer leading services and work in collaboration with professional sectors and global companies.",
    "زوايا الابتكار": "Corners of Innovation",
    "نطور منهجيات تدريبية جديدة تتوافق مع احتياجات السوق المتغيرة.": "We develop new training methodologies that align with changing market needs.",
    "إ": "G",
    "ن": "T",
    "ج": "O",
    "قالوا عنا": "What They Say About Us",
    "اكتشف تجارب عملائنا المتميزة": "Discover Our Clients' Exceptional Experiences",
    "نحن في مركز إنجاز المتحدة للتدريب نفخر بتقديم تجارب تعليمية لا تُنسى. إليك ما قاله بعض عملائنا": "At Enjaz United Training Center, we take pride in providing unforgettable educational experiences. Here’s what some of our clients have to say.",
    "صورة تزيينية": "Decorative Image",
    "نحظى بثقة أكثر من": "Trusted by over",
    "3000 شريك": "3000 partners",
    "في تقديم حلول متكاملة لتعزيز الكفاءات وتحقيق النجاح المؤسسي": "in delivering comprehensive solutions to enhance capabilities and achieve organizational success",
    "أهم المجالات التدريبية المطلوبة": "Most In-Demand Training Fields",
    "في مركز إنجاز المتحدة للتدريب، نلتزم بتطوير محتوى تدريبي يعكس احتياجات السوق المتجددة، وذلك من خلال فريق تطوير متخصص يعمل باستمرار على تصميم وتحديث البرامج التدريبية الأكثر طلباً.": "At Enjaz United Training Center, we are committed to developing training content that reflects the evolving market needs, through a dedicated development team that continuously designs and updates the most in-demand training programs.",
    "العملاء الراضين": "Satisfied Clients",
    "دورة تدربية": "Training Courses",
    "نبني الثقة من خلال جودة لا تضاهى وتجارب متميزة": "Building Trust Through Unmatched Quality and Exceptional Experiences",
    "المشاريع المنجزة": "Completed Projects",
    "وظيفة": "Jobs",
    "مدربين خبراء": "Expert Trainers",
    "التعلم الإلكتروني المتقدم": "Advanced e-Learning",
    "التدريب الذكي على الأجهزة المحمولة": "Smart Mobile Training",
    "نظام التدريب الذكي على الأجهزة المحمولة": "Smart Mobile Training System",
    "التعلم الإلكتروني المتقدم، يستخدم منصات تفاعلية ومحاكاة ليوفر تجربة تدريب مرنة ومخصصة. يسهل على المتدربين من الوصول إلى الدورات واكتساب المهارات العملية في بيئة تفاعلية مشابهة للواقع.": "Advanced e-Learning uses interactive platforms and simulations to provide a flexible, personalized training experience, making it easy for trainees to access courses and acquire practical skills in a realistic environment.",
    "تتيح التفاعلية ويتيح للمتدربين الوصول إلى المحتوى أينما كانوا لاكتساب مهارات جديدة بشكل فعال ومباشر.": "Allows trainees to access content wherever they are to gain new skills effectively and directly.",
    "لقد كانت تجربتنا مع إنجاز مذهلة! من تحليل الاحتياجات التدريبية إلى تنفيذ البرامج، كل شيء تم بشكل احترافي. لقد ساعدونا في تطوير مهارات فريقنا بشكل ملحوظ، ونحن نرى نتائج إيجابية في الأداء.": "Our experience with Enjaz was amazing! From training needs analysis to program implementation, everything was done professionally. They helped us significantly develop our team's skills, and we are seeing positive results in performance.",
    "اسم المستخدم": "User Name",
    "طالب": "Student",
    "Previous": "Previous",
    "Next": "Next",
    "Avatar": "Avatar",
    "الابتكار وريادة الأعمال": "Innovation and Entrepreneurship",
    "التخطيط الاستراتيجي": "Strategic Planning",
    "التوجيه والإرشاد القيادي": "Leadership Coaching",
    "القيادة والتطوير المهني": "Leadership and Professional Development",
    "تطوير المهارات القيادية": "Leadership Skill Development",
    "إدارة الأزمات وصنع القرار": "Crisis Management and Decision-Making",
    "التكنولوجيا والابتكار المالي": "Technology and Financial Innovation",
    "الذكاء الاصطناعي": "Artificial Intelligence",
    "تحليل البيانات": "Data Analysis",
    "العنصر": "Item",
    "سجل هنا": "Register Here",
    "لا توجد نتائج": "No Results",
    "التالي": "Next",
    "السابق": "Previous",
    "newsletterTitle": "Mailing List",
    "ابق علي اطلاع بآخر الخدمات والاخبار والفعاليات عبر لاشتراك": "Stay updated with the latest services, news, and events by subscribing to our mailing list.",
    "سجل هنا بريدك الالكتروني": "Enter your email here",
    "اشترك الان": "Subscribe Now",
    "الشروط والأحكام": "Terms and Conditions",
    "سياسة الخصوصية": "Privacy Policy",
    "جميع الحقوق محفوظة لمركز إنجاز المتحدة للتدريب 2024": "All rights reserved to Enjaz Center for Training 2024",
    "الرياض": "Riyadh",
    "شارع الملك فيصل، الرياض، حي الحمراء": "King Faisal Street, Riyadh, Al Hamra",
    "الاتصال الهاتفي": "Phone Contact",
    "ساعات العمل: من الأحد إلى الخميس، من 9 صباحًا حتى 5 مساءً.": "Working hours: Sunday to Thursday, 9 AM to 5 PM.",
    "البريد الإلكتروني": "Email",
    "الرد خلال 24 ساعة. لا تتردد في مراسلتنا لمزيد من المعلومات أو الدعم.": "Response within 24 hours. Feel free to email us for more information or support.",
    "موقعنا": "Our Location",
    "أوقات الزيارة: من الأحد إلى الخميس، من 9 صباحًا حتى 5 مساءً.": "Visiting hours: Sunday to Thursday, 9 AM to 5 PM.",
    "الموقع على الخريطة": "Location on the map",
    "تواصل معنا": "Contact Us",
    "انضم إلى أكثر من 3000 شريك ناجح!": "Join over 3000 successful partners!",
    "سجّل الآن واحصل على حلول تدريبية واستشارية مخصصة لدعم نموك المؤسسي وتعزيز الكفاءات. نحن هنا لنساعدك على تحقيق أهدافك.": "Register now and receive customized training and consulting solutions to support your institutional growth and enhance competencies. We are here to help you achieve your goals.",
    "تسجيل": "Register"








}